bhsh/spc560/SPC560Pxx_RLA STM Test Application for Discovery/components/spc560pxx_low_level_drivers_component_rla/lib/include/can_lld.h
/*
    SPC5 RLA - Copyright (C) 2015 STMicroelectronics

    Licensed under the Apache License, Version 2.0 (the "License").
    You may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
    Portion of the code in this module have been taken from the ChibiOS
    project (ChibiOS - Copyright (C) 2006..2015) licensed under Apache
    2.0 license.
*/

/**
 * @file    can_lld.h
 * @brief   SPC5xx CAN low level driver header.
 *
 * @addtogroup CAN
 * @{
 */

#ifndef _CAN_LLD_H_
#define _CAN_LLD_H_

#include "spc5_lld.h"
#include "lldconf.h"

#if (LLD_USE_CAN == TRUE) || defined(__DOXYGEN__)

#include "spc5_flexcan.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    CAN status flags
 * @{
 */
/**
 * @brief   Errors rate warning.
 */
#define CAN_LIMIT_WARNING           1U
/**
 * @brief   Errors rate error.
 */
#define CAN_LIMIT_ERROR             2U
/**
 * @brief   Bus off condition reached.
 */
#define CAN_BUS_OFF_ERROR           4U
/**
 * @brief   Framing error of some kind on the CAN bus.
 */
#define CAN_FRAMING_ERROR           8U
/**
 * @brief   Overflow in receive queue.
 */
#define CAN_OVERFLOW_ERROR          16U
/** @} */

/**
 * @brief   Special mailbox identifier.
 */
#define CAN_ANY_MAILBOX             0U
/**
 * @brief   This switch defines whether the driver implementation supports
 *          a low power switch mode with an automatic wakeup feature.
 */
#define CAN_SUPPORTS_SLEEP          FALSE

/**
 * @brief   This implementation supports eight FIFO receive filters.
 */
#define SPC5_CAN_MAX_FILTERS        8U

/**
 * @brief   Enable filters.
 */
#define SPC5_CAN_FILTER_ON          1U

/**
 * @brief   Disable filters.
 */
#define SPC5_CAN_FILTER_OFF         0U

/**
 * @name    CAN registers helper macros
 * @{
 */
#define CAN_MCR_MAXMB(n)            (uint32_t)(n)
#define CAN_MCR_AEN                 (1UL << 12)
#define CAN_MCR_LPRIO_EN            (1UL << 13)
#define CAN_MCR_BCC                 (1UL << 16)
#define CAN_MCR_SRX_DIS             (1UL << 17)
#define CAN_MCR_LPM_ACK             (1UL << 20)
#define CAN_MCR_WRN_EN              (1UL << 21)
#define CAN_MCR_SUPV                (1UL << 23)
#define CAN_MCR_FRZ_ACK             (1UL << 24)
#define CAN_MCR_WAK_MSK             (1UL << 26)
#define CAN_MCR_NOT_RDY             (1UL << 27)
#define CAN_MCR_HALT                (1UL << 28)
#define CAN_MCR_FEN                 (1UL << 29)
#define CAN_MCR_FRZ                 (1UL << 30)
#define CAN_MCR_MDIS                (1UL << 31)

#define CAN_CTRL_PROPSEG(n)         (uint32_t)(n)
#define CAN_CTRL_LOM                (1UL << 3)
#define CAN_CTRL_TSYN               (1UL << 5)
#define CAN_CTRL_BOFF_REC           (1UL << 6)
#define CAN_CTRL_SMP                (1UL << 7)
#define CAN_CTRL_RWRN_MSK           (1UL<< 10)
#define CAN_CTRL_TWRN_MSK           (1UL<< 11)
#define CAN_CTRL_LPB                (1UL<< 12)
#define CAN_CTRL_CLK_SRC            (1UL<< 13)
#define CAN_CTRL_ERR_MSK            (1UL<< 14)
#define CAN_CTRL_BOFF_MSK           (1UL<< 15)
#define CAN_CTRL_PSEG2(n)           ((uint32_t)(n) << 16)
#define CAN_CTRL_PSEG1(n)           ((uint32_t)(n) << 19)
#define CAN_CTRL_RJW(n)             ((uint32_t)(n) << 22)
#define CAN_CTRL_PRESDIV(n)         ((uint32_t)(n) << 24)

#define CAN_IDE_STD                 0U          /**< @brief Standard id.    */
#define CAN_IDE_EXT                 1U           /**< @brief Extended id.    */

#define CAN_RTR_DATA                0U           /**< @brief Data frame.     */
#define CAN_RTR_REMOTE              1U           /**< @brief Remote frame.   */

#define CAN_ESR_ERR_INT             (1UL << 1)
#define CAN_ESR_BOFF_INT            (1UL << 2)
#define CAN_ESR_TWRN_INT            (1UL << 17)
#define CAN_ESR_RWRN_INT            (1UL << 16)
/** @} */

/**
 * @brief  canmsg_t constant
 */
#define CAN_MSG_OK        			(1UL << 1)	/**< @brief message OK.    		  */
#define CAN_MSG_WAIT				(1UL << 2)	/**< @brief mailbox is non empty. wait   */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   CAN filters enable setting.
 */
#if !defined(SPC5_CAN_USE_FILTERS) || defined(__DOXYGEN__)
#define SPC5_CAN_USE_FILTERS                FALSE
#endif

/**
 * @brief   FlexCAN clock source selection.
 */
#if !defined(SPC5_CAN_FLEXCAN_USE_EXT_CLK) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN_USE_EXT_CLK        FALSE
#endif

/**
 * @brief   CAN1 driver enable switch.
 * @details If set to @p TRUE the support for CAN1 is included.
 */
#if !defined(SPC5_CAN_USE_FLEXCAN0) || defined(__DOXYGEN__)
#define SPC5_CAN_USE_FLEXCAN0               FALSE
#endif

/**
 * @brief   CAN2 driver enable switch.
 * @details If set to @p TRUE the support for CAN2 is included.
 */
#if !defined(SPC5_CAN_USE_FLEXCAN1) || defined(__DOXYGEN__)
#define SPC5_CAN_USE_FLEXCAN1               FALSE
#endif

/**
 * @brief   CAN3 driver enable switch.
 * @details If set to @p TRUE the support for CAN3 is included.
 */
#if !defined(SPC5_CAN_USE_FLEXCAN2) || defined(__DOXYGEN__)
#define SPC5_CAN_USE_FLEXCAN2               FALSE
#endif

/**
 * @brief   CAN4 driver enable switch.
 * @details If set to @p TRUE the support for CAN4 is included.
 */
#if !defined(SPC5_CAN_USE_FLEXCAN3) || defined(__DOXYGEN__)
#define SPC5_CAN_USE_FLEXCAN3               FALSE
#endif

/**
 * @brief   CAN5 driver enable switch.
 * @details If set to @p TRUE the support for CAN5 is included.
 */
#if !defined(SPC5_CAN_USE_FLEXCAN4) || defined(__DOXYGEN__)
#define SPC5_CAN_USE_FLEXCAN4               FALSE
#endif

/**
 * @brief   CAN6 driver enable switch.
 * @details If set to @p TRUE the support for CAN6 is included.
 */
#if !defined(SPC5_CAN_USE_FLEXCAN5) || defined(__DOXYGEN__)
#define SPC5_CAN_USE_FLEXCAN5               FALSE
#endif

/**
 * @brief   Number of RX mailboxes.
 */
#if !defined(SPC5_CAN_NUM_RX_MAILBOXES) || defined(__DOXYGEN__)
#define SPC5_CAN_NUM_RX_MAILBOXES           8
#endif

/**
 * @brief   Number of TX mailboxes.
 */
#if !defined(SPC5_CAN_NUM_TX_MAILBOXES) || defined(__DOXYGEN__)
#define SPC5_CAN_NUM_TX_MAILBOXES           24
#endif

/**
 * @brief   CAN1 interrupt priority level setting.
 */
#if !defined(SPC5_CAN_FLEXCAN0_IRQ_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN0_IRQ_PRIORITY      11
#endif

/**
 * @brief   CAN2 interrupt priority level setting.
 */
#if !defined(SPC5_CAN_FLEXCAN1_IRQ_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN1_IRQ_PRIORITY      11
#endif

/**
 * @brief   CAN3 interrupt priority level setting.
 */
#if !defined(SPC5_CAN_FLEXCAN2_IRQ_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN2_IRQ_PRIORITY      11
#endif

/**
 * @brief   CAN4 interrupt priority level setting.
 */
#if !defined(SPC5_CAN_FLEXCAN3_IRQ_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN3_IRQ_PRIORITY      11
#endif

/**
 * @brief   CAN5 interrupt priority level setting.
 */
#if !defined(SPC5_CAN_FLEXCAN4_IRQ_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN4_IRQ_PRIORITY      11
#endif

/**
 * @brief   CAN6 interrupt priority level setting.
 */
#if !defined(SPC5_CAN_FLEXCAN5_IRQ_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN5_IRQ_PRIORITY      11
#endif

/**
 * @brief   FlexCAN-0 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN0_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN0_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexCAN-0 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN0_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN0_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   FlexCAN-1 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN1_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN1_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexCAN-1 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN1_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN2_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   FlexCAN-2 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN2_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN2_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexCAN-2 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN2_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN2_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   FlexCAN-3 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN3_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN3_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexCAN-3 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN3_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN3_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   FlexCAN-4 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN4_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN4_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexCAN-4 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN4_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN4_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   FlexCAN-5 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN5_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN5_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexCAN-5 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_CAN_FLEXCAN5_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_CAN_FLEXCAN5_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

