bhsh/spc560/SPC560Pxx_RLA STM Test Application for Discovery/components/spc560pxx_low_level_drivers_component_rla/lib/include/can_lld.h
#if (SPC5_CAN_USE_FLEXCAN0 == TRUE) && (SPC5_HAS_FLEXCAN0 == FALSE)
#error "CAN1 not present in the selected device"
#endif

#if (SPC5_CAN_USE_FLEXCAN1 == TRUE) && (SPC5_HAS_FLEXCAN1 == FALSE)
#error "CAN2 not present in the selected device"
#endif

#if (SPC5_CAN_USE_FLEXCAN2 == TRUE) && (SPC5_HAS_FLEXCAN2 == FALSE)
#error "CAN3 not present in the selected device"
#endif

#if (SPC5_CAN_USE_FLEXCAN3 == TRUE) && (SPC5_HAS_FLEXCAN3 == FALSE)
#error "CAN4 not present in the selected device"
#endif

#if (SPC5_CAN_USE_FLEXCAN4 == TRUE) && (SPC5_HAS_FLEXCAN4 == FALSE)
#error "CAN5 not present in the selected device"
#endif

#if (SPC5_CAN_USE_FLEXCAN5 == TRUE) && (SPC5_HAS_FLEXCAN5 == FALSE)
#error "CAN6 not present in the selected device"
#endif

#if (SPC5_CAN_USE_FLEXCAN0 == FALSE) && (SPC5_CAN_USE_FLEXCAN1 == FALSE)                        \
    && (SPC5_CAN_USE_FLEXCAN2 == FALSE) && (SPC5_CAN_USE_FLEXCAN3 == FALSE)                    \
    && (SPC5_CAN_USE_FLEXCAN4 == FALSE) && (SPC5_CAN_USE_FLEXCAN5 == FALSE)
#error "CAN driver activated but no CAN peripheral assigned"
#endif

#if (SPC5_CAN_NUM_RX_MAILBOXES < 1U) || (SPC5_CAN_NUM_RX_MAILBOXES > SPC5_FLEXCAN0_MB)
#error "invalid number of RX mailboxes"
#endif

#if (SPC5_CAN_NUM_TX_MAILBOXES < 1U) || (SPC5_CAN_NUM_TX_MAILBOXES > SPC5_FLEXCAN0_MB)
#error "invalid number of TX mailboxes"
#endif

#if (SPC5_CAN_NUM_RX_MAILBOXES + SPC5_CAN_NUM_TX_MAILBOXES) > SPC5_FLEXCAN0_MB
#error "invalid amount of RX and TX mailboxes"
#endif

/**
 * @brief   Number of RX mailboxes to be allocated.
 */
#define CAN_TX_MAILBOXES            SPC5_CAN_NUM_TX_MAILBOXES

/**
 * @brief   Number of TX mailboxes to be allocated.
 */
#define CAN_RX_MAILBOXES            SPC5_CAN_NUM_RX_MAILBOXES

#if defined(_SPC564Axx_)
/**
 * @brief   CAN Clock clock divider value.
 * @note    Possible values are 1 and 2.
 */
#if !defined(SPC5_CANCLK_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CANCLK_DIV_VALUE               1U
#endif
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a transmission mailbox index.
 */
typedef uint32_t canmbx_t;

 /**
  * @brief   type of return message for can driver
  */
 typedef uint32_t canmsg_t;

 /* PPC register definitions not compatible with MISRA rules on bit-fields 
   (Rules 6.1). */
/*lint -e46 */
/**
 * @brief   CAN TX MB structure.
 */
typedef struct {
  union {
    vuint32_t R;
    struct {
      vuint8_t:4;
      vuint8_t CODE:4;
      vuint8_t:1;
      vuint8_t SRR:1;
      vuint8_t IDE:1;
      vuint8_t RTR:1;
      vuint8_t LENGTH:4;
      vuint16_t TIMESTAMP:16;
    } B;
  } CS;

  union {
    vuint32_t R;
    struct {
      vuint8_t PRIO:3;
      vuint32_t ID:29;
    } B;
  } ID;
  vuint32_t DATA[2];     /* Data buffer in words (32 bits) */
} CAN_TxMailBox_TypeDef;

/**
 * @brief   CAN transmission frame.
 * @note    Accessing the frame data as word16 or word32 is not portable because
 *          machine data endianness, it can be still useful for a quick filling.
 */
typedef struct { 
  uint8_t                 LENGTH:4;       /**< @brief Data length.        */
  uint8_t                 RTR:1;          /**< @brief Frame type.         */
  uint8_t                 IDE:1;          /**< @brief Identifier type.    */
  union { 
    uint32_t              SID:11;         /**< @brief Standard identifier.*/ 
    uint32_t              EID:29;         /**< @brief Extended identifier.*/  
  };
  union {
    uint8_t                 data8[8];       /**< @brief Frame data.         */
    uint16_t                data16[4];      /**< @brief Frame data.         */
    uint32_t                data32[2];      /**< @brief Frame data.         */
  };
} CANTxFrame;

/**
 * @brief   CAN received frame.
 * @note    Accessing the frame data as word16 or word32 is not portable because
 *          machine data endianness, it can be still useful for a quick filling.
 */
typedef struct {
  uint16_t                TIME;           /**< @brief Time stamp.         */
  uint8_t                 LENGTH:4;       /**< @brief Data length.        */
  uint8_t                 RTR:1;          /**< @brief Frame type.         */
  uint8_t                 IDE:1;          /**< @brief Identifier type.    */
  union { 
    uint32_t              SID:11;         /**< @brief Standard identifier.*/
    uint32_t              EID:29;         /**< @brief Extended identifier.*/  
  };
  union {
    uint8_t                 data8[8];       /**< @brief Frame data.         */
    uint16_t                data16[4];      /**< @brief Frame data.         */
    uint32_t                data32[2];      /**< @brief Frame data.         */
  };
} CANRxFrame;

/**
 * @brief   CAN filter.
 * @note    Refer to the SPC5 reference manual for info about filters.
 */
typedef struct {
  /**
   * @brief   Filter scale.
   * @note    This bit represents the EXT bit associated to this
   *          filter (0=standard ID mode, 1=extended ID mode).
   */
  uint32_t                  scale:1;
  /**
   * @brief   Filter register (identifier).
   */
  uint32_t                  register1;
} CANFilter;
/*lint +e46 */
/**
 * @brief   Driver configuration structure.
 */
typedef struct {
 /**
   * @brief   CAN MCR register initialization data.
   * @note    Some bits in this register are enforced by the driver regardless
   *          their status in this field.
   */
  uint32_t                  mcr;
  /**
   * @brief   CAN CTRL register initialization data.
   * @note    Some bits in this register are enforced by the driver regardless
   *          their status in this field.
   */
  uint32_t                  ctrl;
#if SPC5_CAN_USE_FILTERS
  /**
   * @brief   CAN filters structure.
   */
  CANFilter                 RxFilter[CAN_RX_MAILBOXES];
#endif
} CANConfig;

/**
 * @brief   Structure representing an CAN driver.
 */
typedef struct {
  /**
   * @brief   Current configuration data.
   */
  const CANConfig           *config;
  /**
   * @brief   Pointer to the CAN registers.
   */
  volatile struct spc5_flexcan *flexcan;
} CANDriver;

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @name    Macro Functions
 * @{
 */
/**
 * @brief   Converts a mailbox index to a bit mask.
 */
#define CAN_MAILBOX_TO_MASK(mbx) (1 << ((mbx) - 1))
/** @} */

/*===========================================================================*/
/* IRQ Handlers                                                              */
/*===========================================================================*/

#if (SPC5_CAN_USE_FLEXCAN0 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_FLEXCAN0_SHARED_IRQ == FALSE)
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_00_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_01_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_02_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_04_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_05_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_06_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_08_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_09_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_10_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_12_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_13_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_14_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN0_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN0_ESR_ERR_INT_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_ESR_BOFF_HANDLER);
#else
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_08_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_12_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN0_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_00_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_BUF_04_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN0_ESR_ERR_INT_HANDLER); 
IRQ_HANDLER(SPC5_FLEXCAN0_ESR_BOFF_HANDLER);
#endif
#endif /* SPC5_CAN_USE_FLEXCAN0 */
#if (SPC5_CAN_USE_FLEXCAN1 == TRUE)|| defined(__DOXYGEN__)
#if (SPC5_FLEXCAN1_SHARED_IRQ == FALSE)
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_00_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_01_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_02_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_04_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_05_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_06_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_08_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_09_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_10_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_12_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_13_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_14_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN1_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN1_ESR_ERR_INT_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_ESR_BOFF_HANDLER);
#else
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_08_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_12_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN1_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_00_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_BUF_04_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN1_ESR_ERR_INT_HANDLER); 
IRQ_HANDLER(SPC5_FLEXCAN1_ESR_BOFF_HANDLER);
#endif
#endif /* SPC5_CAN_USE_FLEXCAN1 */
#if (SPC5_CAN_USE_FLEXCAN2 == TRUE)|| defined(__DOXYGEN__)
#if (SPC5_FLEXCAN2_SHARED_IRQ == FALSE)
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_00_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_01_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_02_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_04_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_05_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_06_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_08_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_09_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_10_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_12_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_13_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_14_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN2_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN2_ESR_ERR_INT_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_ESR_BOFF_HANDLER);
#else
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_08_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_12_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN2_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_00_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_BUF_04_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN2_ESR_ERR_INT_HANDLER); 
IRQ_HANDLER(SPC5_FLEXCAN2_ESR_BOFF_HANDLER);
#endif
#endif /* SPC5_CAN_USE_FLEXCAN2 */
#if (SPC5_CAN_USE_FLEXCAN3 == TRUE)|| defined(__DOXYGEN__)
#if (SPC5_FLEXCAN3_SHARED_IRQ == FALSE)
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_00_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_01_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_02_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_04_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_05_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_06_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_08_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_09_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_10_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_12_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_13_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_14_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN3_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN3_ESR_ERR_INT_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_ESR_BOFF_HANDLER);
#else
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_08_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_12_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN3_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_00_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_BUF_04_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN3_ESR_ERR_INT_HANDLER); 
IRQ_HANDLER(SPC5_FLEXCAN3_ESR_BOFF_HANDLER);
#endif
#endif /* SPC5_CAN_USE_FLEXCAN3 */
#if (SPC5_CAN_USE_FLEXCAN4 == TRUE)|| defined(__DOXYGEN__)
#if (SPC5_FLEXCAN4_SHARED_IRQ == FALSE)
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_00_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_01_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_02_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_04_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_05_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_06_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_08_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_09_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_10_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_12_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_13_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_14_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN4_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN4_ESR_ERR_INT_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_ESR_BOFF_HANDLER);
#else
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_08_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_12_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN4_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_00_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_BUF_04_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN4_ESR_ERR_INT_HANDLER); 
IRQ_HANDLER(SPC5_FLEXCAN4_ESR_BOFF_HANDLER);
#endif
#endif /* SPC5_CAN_USE_FLEXCAN4 */
#if (SPC5_CAN_USE_FLEXCAN5 == TRUE)|| defined(__DOXYGEN__)
#if (SPC5_FLEXCAN5_SHARED_IRQ == FALSE)
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_00_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_01_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_02_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_04_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_05_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_06_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_08_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_09_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_10_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_12_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_13_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_14_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN5_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN5_ESR_ERR_INT_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_ESR_BOFF_HANDLER);
#else
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_08_11_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_12_15_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_16_31_HANDLER);
#if (SPC5_FLEXCAN5_MB == 64U)
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_32_63_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_00_03_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_BUF_04_07_HANDLER);
IRQ_HANDLER(SPC5_FLEXCAN5_ESR_ERR_INT_HANDLER); 
IRQ_HANDLER(SPC5_FLEXCAN5_ESR_BOFF_HANDLER);
#endif
#endif /* SPC5_CAN_USE_FLEXCAN5 */

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#if (SPC5_CAN_USE_FLEXCAN0 == TRUE) && !defined(__DOXYGEN__)
extern CANDriver CAND1;
#endif

#if (SPC5_CAN_USE_FLEXCAN1 == TRUE) && !defined(__DOXYGEN__)
extern CANDriver CAND2;
#endif

#if (SPC5_CAN_USE_FLEXCAN2 == TRUE) && !defined(__DOXYGEN__)
extern CANDriver CAND3;
#endif

#if (SPC5_CAN_USE_FLEXCAN3 == TRUE) && !defined(__DOXYGEN__)
extern CANDriver CAND4;
#endif

#if (SPC5_CAN_USE_FLEXCAN4 == TRUE) && !defined(__DOXYGEN__)
extern CANDriver CAND5;
#endif

#if (SPC5_CAN_USE_FLEXCAN5 == TRUE) && !defined(__DOXYGEN__)
extern CANDriver CAND6;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void can_lld_init(void);
  void can_lld_start(CANDriver *canp,const CANConfig *config);
  void can_lld_stop(CANDriver *canp);
  uint8_t can_lld_is_tx_empty(CANDriver *canp,
                           canmbx_t mailbox); 
  canmsg_t can_lld_transmit(CANDriver *canp,
                        canmbx_t mailbox,
                        const CANTxFrame *ctfp);
  uint8_t can_lld_is_rx_nonempty(CANDriver *canp,
                              canmbx_t mailbox);
  canmsg_t can_lld_receive(CANDriver *canp,
                       canmbx_t mailbox,
                       CANRxFrame *crfp);
#ifdef __cplusplus
}
#endif

#endif /* LLD_USE_CAN */

#endif /* _CAN_LLD_H_ */

/** @} */
